app/controllers/signup_controller.rb

INSERT INTO `users` (`dob`, `updated_at`, `primary_email`, `password_salt`, `password_hash`, `persistence_token`, `first_name`, `last_name`, `created_at`) VALUES(NULL, '2009-11-15 22:50:30', 'j@j.com', '4_DU40GG3GeNnokNysLU', 'aaf3c3cae9ed8018a6cf229c1b0de7cf4f73492e8f4267ca78e725177c6e6ceae0dbda2ce31a6f5be5edb2d2e669f9c3baf0f5bae5ad2bc3c381356e247b274c', '6d5f8658362c708ffe80d3dd25dea4d0601a4708b3cd00c2168ca4a7ec25d10ba03b12aa285a7f1d026a5d42ff6b75828453d4c000b3d9ffab52951f7ac471cd', 'John', 'Coltrane', '2009-11-15 22:50:30')
SELECT `users`.id FROM `users` WHERE (LOWER(`users`.`primary_email`) = BINARY 'j@j.com') LIMIT 1
---
  def create
    ActiveRecord::Base.transaction do
      begin
        @user = SimpleUser.new
        @user.first_name = params[:simple_user][:first_name]
        @user.last_name = params[:simple_user][:last_name]
        @user.primary_email = params[:simple_user][:primary_email]
        @user.password = params[:simple_user][:password]

        @user.detail = UserDetail.create!
        @user.settings = UserSetting.create!

        @user.save!
        @user.steps << AchievementStep.find(1)